doc/readme.org
# -*- org-use-sub-superscripts: nil; org-export-with-sub-superscripts: nil; -*-

#+title: README about the ispell_eo dictionary
# #+HTML_HEAD_EXTRA: <style> pre { background-color: #191919; color: white; }</style>
#+HTML_HEAD_EXTRA: <style> pre.src { background-color: black; color: white; }</style>
#+OPTIONS: toc:nil
- *Name*:   ~./README~
- *Content*: Information about Esperanto dictionary for the Ispell speller
- *Created*: 2024-01-19 by Sergio Pokrovskij ~<sergio.pokrovskij(cxe)gmail.com>~
- *Version*: 4.3

Copyright © 1997, 1998, 2003, 2006, 2008, 2024 by Sergio Pokrovskij

This dictionary package is available on the terms of GNU General Public
License version 2.0 (Free Software Foundation, 675 Mass Ave, Cambridge,
MA 02139, USA).

#+TOC: headlines 3

* About the Package
Here is an Esperanto spelling dictionary, compiled by Sergio Pokrovskij for the
versions 3+ of [[https://en.wikipedia.org/wiki/Ispell][Ispell]].

The dictionary can also be converted into an ~eo.utf-8.spl~ file for
use with the [[https://vimdoc.sourceforge.net/htmldoc/spell.html][Vim Speller]] (see ~:help spell~ in vim itself).
# V:
# V: (There also is a [[https://www.vim.org/scripts/script.php?script_id=135][VIM-Spell spell-checker plugin]] for VIM based on
# V: Ispell or Aspell, which are more widely usable with other applications
# V: as well.)

# some more comments are in [[https://github.com/pok49/ispell-eo/blob/master/legu-min.l3][legu-min.l3]]
[[https://github.com/pok49/ispell-eo/blob/gh-pages/doc/ispelleo-legu-min.html][# legu-min]]
# (in esperanto).

* Quick Install
** Ispell
You will need to have Ispell 3.0+; its precompiled package is
available in most of Linux repositories, the source tarball can be
downloaded from its [[https://www.cs.hmc.edu/~geoff/ispell.html#ftp-sites][official site]]; if you compile it from the sources,
make sure that in its =local.h= the =NO8BIT= thing is commented out
and ~MASKBITS = 64~. To see the option =ispell= has been compiled with,
please run
#+begin_src sh
$ ispell -vv | grep MASKBITS
#+end_src
The result should be:
#+RESULTS:
: 	MASKBITS = 64

<<Binary>>
*** The Binary File
Here is a binary dictionary [[https://kovro.heliohost.org/eo/tools/ispelleo/eo.hash][eo.hash]], made for Linux x86_64. It should
be placed where Ispell expects to find it, in my case it is
#+begin_src sh
$ ispell -vv | grep LIBDIR
#+end_src

: 	LIBDIR = "/usr/lib/ispell"

You can test your installation by an ASCII transliteration on any
terminal:
#+begin_src sh
$ echo "Kuba harpisto sxajnis amuzigxi facilege cxe via jxauxda hxoro" |\
ispell -T cxirkaux -d eo
#+end_src

#+begin_example
@(#) International Ispell Version 3.4.02 08 Jan 2021
word: ok
ok (derives from root HARPI)
ok (derives from root ^SAJNI)
ok (derives from root AMUZI)
ok (derives from root FACILEGA)
ok
ok (derives from root VI)
ok
ok

word:
#+end_example
or by Unicode representation, if your terminal works in UTF-8:
#+begin_src sh
$ echo "Ŝajnas ke sagaca monaĥo laŭtvoĉe refuzadis pregi syr herbaĵo" |\
ispell -P -T utf8 -d eo
#+end_src

#+begin_example
@(#) International Ispell Version 3.4.02 08 Jan 2021
word: ok (derives from root ^SAJNI)
ok
ok
ok
ok (derives from root LA^UTVO^CA)
how about: refutadis, reuzadis, rifuzadis
how about: predi, preĝi, premi, preni, presi, preti, puregi, regi
how about: sur
ok (derives from root HERBO)

word:
#+end_example
Also see the section “[[Uzo][Usage]]” below.


*** Building eo.hash
If the binary =eo.hash= proves incompatible with your system, you can
build it yourself from [[https://kovro.heliohost.org/eo/tools/ispelleo/eo.aff][eo.aff]] and [[https://kovro.heliohost.org/eo/tools/ispelleo/eo.asc][eo.asc]]:
1. Download the files.
2. Use the =buildhash= utility from the =ispell= distro:
#+begin_example
buildhash eo.asc eo.aff eo.hash
#+end_example
You now can try the new =eo.hash= and proceed back to “[[Binary][The Binary File]]”.

** Vim's Speller
There is an obsolete [[https://www.vim.org/scripts/script.php?script_id=465][vimspell plugin]] for the ubiquitous [[https://en.wikipedia.org/wiki/Vim_(text_editor)][Vim editor]],
which provides an interface to =ispell= and =aspell=. You should be
able to use the ispell-eo dictionaries via this interface (I did not
test it). Yet it is no longer supported:
#+begin_quote
*note to VIM 7 users !*

Version 7 of vim integrates a native spellchecker which outperforms
vimspell script. As such I will not maintain anymore vimspell script,
and you are advised to delete all related files from your plugin/ and
doc/ directory, and use the native spellchecker instead.
#+end_quote

I have written a converter from my Ispell source dictionary to the Vim's
Spell format (which is basically the [[https://en.wikipedia.org/wiki/MySpell][MySpell]] format).

The ready-made packed dictionary is available for download as
[[https://kovro.heliohost.org/eo/tools/vim-spell/eo.utf-8.spl][eo.utf-8.spl]]. You can install it locally for yourself in
~$HOME/.vim/spell~, or in a system-wide manner in a =spell= or =after=
subdirectory of Vim's =runtimepath= variable. (To examine its value
say ~:echo &runtimepath~).

In order to invoke Esperanto spell say ~:setlocal spell spelllang=eo~.
For help about speller commands see
: :h spell
(or see the same documentation [[https://vim-jp.org/vimdoc-en/spell.html#spell][on the Web]]).

* For the Ispell Utility Program
<<styles>>
** Esperanto encodings
Several encodings used with Esperanto text are supported:

1. The very best is Unicode or its subset, which contains the
   esperantic letters, like the Microsoft's WGL4 or better ISO's MES-1
   or MES-2; you can use it with =xterm= or =Emacs= under Unix, or
   with =UniRed= under Windows.

   Unicode is available in UTF-8 encoding, which is preferred for the
   Unices.

2. The second best choice used to be the Latin‑3 encoding (ISO-8859‑3);
   it is obsolete by now.

3. For the sake of the ASCII-impaired (and ANSI-impaired), there are two
   surrogates:

   - The TeX-like =^cirka^u-style: e^ho^san^go ^ciu^ja^ude=. Presently
     this is used as the reference representation, mainly because it is
     unambiguous (cf names like /Michaux/); and

   - The popular =cxirkaux-style=, which is also convenient for
     lexicographical ordering and thus is used in the dictionaries;
     besides, it uses ASCII letters only, and that makes it suitable for
     various names in computer programs.

* Installation from Scratch
** Simple Install (Unix or Cygwin)
1. Clone the =ispel-eo= project into your local repository:
   : $ git clone https://github.com/pok49/ispell-eo
2. Go to the root directory =ispell-eo= (where this =readme= resides).
3. Say
   : $ make first
   (or simply =make=) in order to check your =ispell= program.
   Examine the output, e.g. do you have the permissions to write the
   hash file(s) at the install phase?
4. If everything is OK, say
   : $ make eo
   (to built the strict dictionary), or
   : $ make esperanto
   (to built a permissive dictionary), or
   : $ make all
   (to built both).
   You may get a few warnings of from =buildhash=, like this one:
   :  eo.aff line 218: Flag must be alphabetic
   Just ignore them.
5. Type
   : $ make install
   to copy the hash file(s) to where Ispell expects them to be
   (probably you already have your =american.hash= there; normally you
   shall need the root rights to make install).

After that you can call, for instance,
: $ ispell -d eo -T cxirkaux $HOME/Git/ispell-eo/doc/ekz.cx
(=ekz.cx= is an ASCII file, in which the Esperantic letters are
presented in =cxirkaux=-surrogate, as the =-T cxirkaux= argument
states; this ASCII interface should work on any terminal).

