README.md
-   **Name**:   `./README`
-   **Content**: Information about Esperanto dictionary for the Ispell speller
-   **Created**: 2024-01-19 by Sergio Pokrovskij `<sergio.pokrovskij(cxe)gmail.com>`
-   **Version**: 4.3

Copyright © 1997, 1998, 2003, 2006, 2008, 2024 by Sergio Pokrovskij

This dictionary package is available on the terms of GNU General Public
License version 2.0 (Free Software Foundation, 675 Mass Ave, Cambridge,
MA 02139, USA).


# Table of Contents

1.  [About the Package](#org41dc846)
2.  [Quick Install](#orga83e462)
    1.  [Ispell](#orgdd3dc73)
        1.  [The Binary File](#org49310eb)
        2.  [Building eo.hash](#org3973b9d)
    2.  [Vim's Speller](#orgb327f74)
3.  [For the Ispell Utility Program](#orgd2a607d)
    1.  [Esperanto encodings](#orgcc3df73)
4.  [Installation from Scratch](#orgaab5d1c)
    1.  [Simple Install (Unix or Cygwin)](#orgffead5d)
    2.  [Vim](#org4e9d7a8)
    3.  [Customized Build](#org58c2a2f)
5.  [Usage](#org13d66fa)
    1.  [Command line](#orge124eec)
        1.  [ASCII terminal](#org1aaed29)
        2.  [Unicode](#org625f9b2)
        3.  [Latin-3](#orgcb665ea)
    2.  [Emacs](#org3c07fff)
6.  [Apostrophes](#org6567e7f)
    1.  [Apostrophes in Wikipedia](#orgf442fb8)
    2.  [Switching the Ispell Dictionaries](#orged9f4b8)
    3.  [Inputting Apostrophes and Quotation Marks](#orgc8a23b8)
    4.  [Further Reading on the Apostrophe problem](#org572fa9f)


<a id="org41dc846"></a>

# About the Package

Here is an Esperanto spelling dictionary, compiled by Sergio Pokrovskij for the
versions 3+ of [Ispell](https://en.wikipedia.org/wiki/Ispell).

The dictionary can also be converted into an `eo.utf-8.spl` file for
use with the [Vim Speller](https://vimdoc.sourceforge.net/htmldoc/spell.html) (see `:help spell` in vim itself).

Some more information is available [in Esperanto](doc/ispelleo-legu-min.md).


<a id="orga83e462"></a>

# Quick Install


<a id="orgdd3dc73"></a>

## Ispell

You will need to have Ispell 3.0+; its precompiled package is
available in most of Linux repositories, the source tarball can be
downloaded from its [official site](https://www.cs.hmc.edu/~geoff/ispell.html#ftp-sites); if you compile it from the sources,
make sure that in its `local.h` the `NO8BIT` thing is commented out
and `MASKBITS = 64`. To see the option `ispell` has been compiled with,
please run

    $ ispell -vv | grep MASKBITS

The result should be:

    MASKBITS = 64

<a id="org4221d94"></a>


<a id="org49310eb"></a>

### The Binary File

Here is a binary dictionary [eo.hash](https://kovro.heliohost.org/eo/tools/ispelleo/eo.hash), made for Linux x86\_64. It should
be placed where Ispell expects to find it, in my case it is

    $ ispell -vv | grep LIBDIR

    LIBDIR = "/usr/lib/ispell"

You can test your installation by an ASCII transliteration on any
terminal:

    $ echo "Kuba harpisto sxajnis amuzigxi facilege cxe via jxauxda hxoro" |\
    ispell -T cxirkaux -d eo

    @(#) International Ispell Version 3.4.02 08 Jan 2021
    word: ok
    ok (derives from root HARPI)
    ok (derives from root ^SAJNI)
    ok (derives from root AMUZI)
    ok (derives from root FACILEGA)
    ok
    ok (derives from root VI)
    ok
    ok
    
    word:

or by Unicode representation, if your terminal works in UTF-8:

    $ echo "Ŝajnas ke sagaca monaĥo laŭtvoĉe refuzadis pregi syr herbaĵo" |\
    ispell -P -T utf8 -d eo

    @(#) International Ispell Version 3.4.02 08 Jan 2021
    word: ok (derives from root ^SAJNI)
    ok
    ok
    ok
    ok (derives from root LA^UTVO^CA)
    how about: refutadis, reuzadis, rifuzadis
    how about: predi, preĝi, premi, preni, presi, preti, puregi, regi
    how about: sur
    ok (derives from root HERBO)
    
    word:

Also see the section “[Usage](#org92fbad2)” below.


<a id="org3973b9d"></a>

### Building eo.hash

If the binary `eo.hash` proves incompatible with your system, you can
build it yourself from [eo.aff](https://kovro.heliohost.org/eo/tools/ispelleo/eo.aff) and [eo.asc](https://kovro.heliohost.org/eo/tools/ispelleo/eo.asc):

1.  Download the files.
2.  Use the `buildhash` utility from the `ispell` distro:

    buildhash eo.asc eo.aff eo.hash

You now can try the new `eo.hash` and proceed back to “[The Binary File](#org4221d94)”.


<a id="orgb327f74"></a>

## Vim's Speller

There is an obsolete [vimspell plugin](https://www.vim.org/scripts/script.php?script_id=465) for the ubiquitous [Vim editor](https://en.wikipedia.org/wiki/Vim_(text_editor)),
which provides an interface to `ispell` and `aspell`. You should be
able to use the ispell-eo dictionaries via this interface (I did not
test it). Yet it is no longer supported:

> **note to VIM 7 users !**
> 
> Version 7 of vim integrates a native spellchecker which outperforms
> vimspell script. As such I will not maintain anymore vimspell script,
> and you are advised to delete all related files from your plugin/ and
> doc/ directory, and use the native spellchecker instead.

I have written a converter from my Ispell source dictionary to the Vim's
Spell format (which is basically the [MySpell](https://en.wikipedia.org/wiki/MySpell) format).

The ready-made packed dictionary is available for download as
[eo.utf-8.spl](https://kovro.heliohost.org/eo/tools/vim-spell/eo.utf-8.spl). You can install it locally for yourself in
`$HOME/.vim/spell`, or in a system-wide manner in a `spell` or `after`
subdirectory of Vim's `runtimepath` variable. (To examine its value
say `:echo &runtimepath`).

In order to invoke Esperanto spell say `:setlocal spell spelllang=eo`.
For help about speller commands see

    :h spell

(or see the same documentation [on the Web](https://vim-jp.org/vimdoc-en/spell.html#spell)).


<a id="orgd2a607d"></a>

# For the Ispell Utility Program

<a id="org56e6dfc"></a>


<a id="orgcc3df73"></a>

## Esperanto encodings

Several encodings used with Esperanto text are supported:

1.  The very best is Unicode or its subset, which contains the
    esperantic letters, like the Microsoft's WGL4 or better ISO's MES-1
    or MES-2; you can use it with `xterm` or `Emacs` under Unix, or
    with `UniRed` under Windows.
    
    Unicode is available in UTF-8 encoding, which is preferred for the
    Unices.

2.  The second best choice used to be the Latin‑3 encoding (ISO-8859‑3);
    it is obsolete by now.

3.  For the sake of the ASCII-impaired (and ANSI-impaired), there are two
    surrogates:
    -   The TeX-like `^cirka^u-style: e^ho^san^go ^ciu^ja^ude`. Presently
        this is used as the reference representation, mainly because it is
        unambiguous (cf names like *Michaux*); and
    
    -   The popular `cxirkaux-style`, which is also convenient for
        lexicographical ordering and thus is used in the dictionaries;
        besides, it uses ASCII letters only, and that makes it suitable for
        various names in computer programs.


<a id="orgaab5d1c"></a>

# Installation from Scratch


<a id="orgffead5d"></a>

## Simple Install (Unix or Cygwin)

1.  Clone the `ispel-eo` project into your local repository:
    
        $ git clone https://github.com/pok49/ispell-eo
2.  Go to the root directory `ispell-eo` (where this `readme` resides).
3.  Say
    
        $ make first
    
    (or simply `make`) in order to check your `ispell` program.
    Examine the output, e.g. do you have the permissions to write the
    hash file(s) at the install phase?
4.  If everything is OK, say
    
        $ make eo
    
    (to built the strict dictionary), or
    
        $ make esperanto
    
    (to built a permissive dictionary), or
    
        $ make all
    
    (to built both).
    You may get a few warnings of from `buildhash`, like this one:
    
        eo.aff line 218: Flag must be alphabetic
    
    Just ignore them.
5.  Type
    
        $ make install
    
    to copy the hash file(s) to where Ispell expects them to be
    (probably you already have your `american.hash` there; normally you
    shall need the root rights to make install).

After that you can call, for instance,

    $ ispell -d eo -T cxirkaux $HOME/Git/ispell-eo/doc/ekz.cx

(`ekz.cx` is an ASCII file, in which the Esperantic letters are
presented in `cxirkaux`-surrogate, as the `-T cxirkaux` argument
states; this ASCII interface should work on any terminal).
