doc/readme.org
** Vim
If the prefabricated =eo.utf-8.spl= dictionary does not work for you,
you could try to pack it on your computer from the files ~eo_l3.aff~
and ~eo_l3.dic~ in the ~ispell-eo/oo/vimspell~ subdirectory:
#+begin_src sh
$ cd $HOME/Git/ispell-eo/vimspell
$ env LANG=eo.utf-8 vim -u NONE -e -c "mkspell! $HOME/.vim/spell/eo eo" -c q 2>&1 > err
#+end_src
This implies that you have installed the Esperantic =eo.utf-8= locale
in your system (available in most Linux distros); it should produce
=eoutf-8.spl= in the =$HOME/.vim/spell/= directory for your private
use.

If you prefer a different composition, you can make the dictionary
yourself. You'll need Emacs to produce the dictionary for =MySpell=
(which used to work with =OpenOffice= and which remains the basis of
the Vim's Spell). =cd= into =$HOME/Git/ispell-eo=; customize the word
provision as described in “[[Customized][Customized Build]]” (except the =buildhash=
and the following steps). In the =Makfile= check its
=vim_spl_install_dir= variable; by default it is set for a local
install in your =$(HOME)/.vim/spell= directory; you may prefer to set
it globally for a system-wide install. Then say
: $ make vim
and
: $ make install_vim
(the latter may require the administrative rights for a system-wide install).

To see Vim Speller in action please open the test file
: $ vim $HOME/Git/ispell-eo/doc/vim-test.u8
and say
: :set spell spelllang=eo

<<Customized>>
** Customized Build
In order to enable selective construction of dictionaries, some entries
in the source dictionary =./src/vortoj.l3= are marked with keywords
indicating the special field they belong to:

=#arhx= : archaic words, like ‹ĥina› (= ‹ĉina›) or ‹malkompreni› (= ‹miskompreni›)\\
=#bot=  : a rare botanic word\\
=#Eujo= : vocabulary of the Esperanto Movement (of ‹Esperantujo›)\\
=#etn=  : ethnography; actually also countries and other geography\\
=#his=  : history\\
=#komp= : some computer-science terminology according to the [[http://www.esperanto.mv.ru/KompLeks/UTF8/DEFAULT.html][Komputada Leksikono]]\\
=#mav=  : redundant words, which are used by some esperantists, though they are less precise and unnecessarily complicate the language; e.g. ‹olda› (‹maljuna› *or* ‹malnova›), ‹mava› (= ‹malbona›)\\
=#mit=  : mythology, religion\\
=#pers= : given names and names of important personalities (e.g. ‹Petro›, ‹Ŝekspiro› ...)\\
=#pok=  : the words specific to my idiolect\\
=#rar=  : rare words which may coincide with a misspelling of a more frequent word; e.g. ‹ajuna›, ‹komanditi›, ‹liona›\\
=#var=  : variant which I do not use but which is frequent enough (e.g. ‹kemio›, ‹tekniko› opposed to ‹ĥemio› and ‹teĥniko›)\\
=#zoo=  : uncommon zoological word

You can ~grep~,
: $ grep '#mav' ./src/vortoj.l3 | less
in order to see if you feel like me about them; you can either remove
all of them from the target dictionary, or remove the =#mav= mark from
those you do use and like; the default setting in the =./Makefile= is
#+begin_example
short_list      =  komp,etn,Eujo,mll
pok_list	=  $(short_list),bot,fremd,his,pok,pers,var,zoo
eo_list         =  $(short_list),drv
esperanto_list  =  $(short_list),arhx,mav,rar
#+end_example

Unless included in the custom list (like =eo_list=), a marked word is
considered as a special one and is excluded from the build.
# sen: the above custom lists thus specify “positive criteria”. But some
# sen: words have several marks (e.g. a word may be “ethnic” and “obsolete”
# sen: or dangerously close to a misspelling of a frequent word). Thus a
# sen: “negative” filtration is available via the =$(sen)= macro; you can
# sen: specify it in =src/Makefile=, or in the command-line:
# sen:
# sen: #+begin_src sh
# sen: make eo sen="arhx,rar"
# sen: #+end_src
# sen:
# sen: In this way some otherwise eligible words from the =komp= or =etn= or
# sen: =mll= categories shall be discarded, if they are also obsolete or rare.

When preparing a dictionary for the Vim Speller it is advisable to
retain the entries marked with ~#mav~ and ~#rar~: in Vim Spell
dictionary they will receive the qualifications =BAD= and =RAR= and as
such will be warned about in an appropriate manner.

# V: * Building vim spell
# V: This package can now be used to build a vim spell dictionary:
# V: 1. Customize the lexical coverage as is described for the ispell
# V:    build.
# V: 2. Convert the affix file to the my-spell format used by vim-spell and
# V:    build the ~eo.utf-8.spl~ dictionary.
# V: 3. Install it into a directory where =vim= expects to find it.
# V:
# V: These steps are done by the ~ispell-eo/Makefile~ in ~ispell-eo/oo~
# V: directory (the name =oo= is a remnant from /Open Office/, which
# V: equally used the MySpell format).
# V:
# V: At the step (1) it is advisable to include the entries marked with
# V: ~#mav~ and ~#rar~: in vim-spell they will receive the qualifications
# V: =BAD= and =RAR= and as such will be warn about unless you accept them
# V: (in a runtime session).
# V:
# V: Before invoking the =Makfile= check its =vim_spl_install_dir=
# V: variable; by default it is set for a local install in your
# V: =$(HOME)/.vim/spell= directory; you may prefer to set it globally for
# V: a system-wide install.
# V:
# V: After that say
# V: #+begin_src sh
# V: make vim
# V: make install_vim
# V: #+end_src
# V: (or ~sudo make install_vim~ for a system-wide install).

<<Uzo>>
* Usage
One same Ispell dictionary, e.g. =eo.hash=, can be used with several
input representations, specified in its affix file (e.g. =eo.aff=).
Each such representation can be identified by a name (used in ispell
invocation as ‘‑T identifier’ argument), or by the extension of the
argument filename; both identification kinds are specified in the
affix file. In case of identification conflict the name argument takes
precedence.

=eo.aff= defines the following representations:
1. =tex= (the extensions are =.tex= or =.bib=)is suited for TeX, and
   imitates the /dead keys:/ ~e^ho^san^g^' ^ciu^ja^de~. It is the
   representation for which =ispell-eo= was originally designed (in
   connection with the “[[https://eo.wikipedia.org/wiki/Komputada_Leksikono][Komputika Leksikono]]”), and it remains the
   basic representation used in =ispell-eo= internally.
2. =cxirkaux= (or =.cx= or =.t=) identifies the x‑style representation,
   which is the most popular ASCIIization of the Esperanto letters;
   ~ehxosxangx' cxiujxauxde~.
3. =latin3= (or =.l3=) is the straightforward application of
   ISO 8859‑3 (aka Latin‑3), which gives all the accented esperantic
   letters their canonical form; the apostrophe is represented as the
   ASCII ='= (0x27).
4. =epo= (or =.la3= or =.wiki=) is like =latin3=, except that the
   apostrophe is represented by ‹´› (0xB4, spacing acute; see below
   the section “[[Apo][Apostrophes]]”); =epo= is the standard 3-letter
   designation of Esperanto in ISO 639.
5. In =utf8= (=.html=, =.u8=, =.utf=) the accented letters are coded by
   2 bytes each according to the UTF-8 encoding; apostrophe is encoded
   as ‹ʼ› (U+02BC, =#xCA #xBC=, modifier letter apostrophe).

Unlike Aspell or Hunspell, Ispell allows switching among these
representations (via the ~-T~ flag: ~‑T tex~, or ~‑T utf8~ etc) while
using the same hash file; this is an advantage of Ispell. OTOH
variation in the word provision (e.g. inclusion or exclusion of the
“bad” words) requires compilation of separate hash files (in our case,
=eo.hash= vs =esperanto.hash=); here Hunspell and Vim Speller are more
flexible, they make it possible to retain the bad words and mark their
use in a special way.

Some usage examples below are illustrated with specimen files from the
~ispell-eo/doc~ directory (which in my case is in my local
~$HOME/Git/~ repository). This should give you an idea about where and
what kind of files could be used in a given situation.

** Command line
You can use Ispell in a stand-alone mode, as a console program. The
usage depends on the encodings available at your terminal emulator for
representing the Esperanto letters.

