doc/readme.org
*** ASCII terminal
This is available anywhere, you can use the =tex= (TeX) or the
=cxirkaux= representation. In the =tex= representation the word
/ĉirkaŭ/ takes the form ~^cirka^u~; in the latter case both esperantic
accents are expressed with the letter =x=, do =cxirkaux=. In order to
check a file with the Ispell dialog editor simply type (for the
x‑notation):
#+begin_src
ispell -d eo -T cxirkaux $HOME/Git/ispell-eo/doc/ekz.cx
#+end_src
or (fro the TeX notation):
#+begin_src
$ ispell -d eo -T tex $HOME/Git/ispell-eo/doc/ekz.^c
#+end_src
The resulting dialog is self-explanatory.

You also can request a list of misspelt words, e.g.
#+begin_src sh
$ cat -b $HOME/Git/ispell-eo/doc/ekz.cx
$ ispell -d eo -T cxirkaux -l < $HOME/Git/ispell-eo/doc/ekz.cx
#+end_src

#+begin_example
     1	Por ke la linguo intrenacia povu bone kaj regule progresadi kaj por ke
     2	gxi havu plenan cetrecon, ke gxi neniam disfalos kaj ia facxilanima
     3	pasxo de gxiaj amikoj estontaj ne detruos la laborojn de gxiaj amikoj
     4	estitaj, -- estas plej necesa antaux cxio unu kondico: la ekzistado de
     5	klare difinita, neniam tusxebla kaj neniam sxangxebla Fundamento ...

     6	en nova form' eksonis nova kant'
linguo
intrenacia
cetrecon
facxilanima
estitaj
kondico
#+end_example

Unfortunately, the Ispell editor is unaware of multibyte characters.

*** Unicode
Ispell is two decades older than Unicode; yet it is possible to use
its general specification facilities to define the UTF-8 encoding of
the Esperantic letters, and it partially works.

The modern Linux terminals use the UTF-8 encoding by default, so you
can say there:

#+begin_src sh
$ ispell -d eo -T utf8 $HOME/Git/ispell-eo/doc/testo.u8
#+end_src

or submit test words in the command  line:

#+begin_src sh
$ echo "faĉilanima paŝo de ĝiaj anikoj estitaj" | ispell -T utf8 -d eo
#+end_src

: @(#) International Ispell Version 3.4.02 08 Jan 2021
: word: how about: facilanima
: ok (derives from root PA^SI)
: ok
: ok (derives from root ^GI)
: how about: amikoj, anigoj, aniĝoj, animoj, aninoj, anizoj, manikoj, panikoj, unikoj
: how about: estigaj, estiĝaj, estimaj, estintaj, estritaj, festitaj, ostitaj, testitaj, vestitaj, esti+taj, estu-u+itaj
:
: word:

(The suggestions are presented in the TeX notation.)

You can also get a list of all misspelled or unknown words from a text:

# #+begin_src sh :exports both :results output :session
#+begin_src sh
$ head -9 $HOME/Git/ispell-eo/doc/Cart.u8
#+end_src
#+begin_example
AL Sinjoro fruictier.
Kara Amiko!
Vi petis, ke mi prezentu vian libron al Esperantistaro.
Prezentadon ĝi ne bezonas: ne sole ĉar la ĉefredaktoro
de »Lingvo Internacia« jam elmontris sian valoron, sed
precipe ĉar lia verko estas kunmetita laŭ principoj
de severega metodo. Eĵektive, kio eslas farita per Scienco
kaj en ĝia nomo, tio tute ne bezonas patronadon, ĉar
ne ekzistas pli atta.
#+end_example
#+begin_src sh
$ head -9 $HOME/Git/ispell-eo/doc/Cart.u8 | ispell -d eo -T utf8 -l
#+end_src
#+begin_example
fruictier
Eĵektive
eslas
atta
#+end_example
(The file =Cart.u8= is produced by OCR of a letter by Th. Cart to Paul
Fruictier, published as a foreword to “Esperanta Sintakso” by the
latter. The letter is printed in italics.)

Such a short file is more conveniently corrected in a text editor
via its speller interface (see “[[e-ini][Emacs]]” below); but when editing a
large file, e.g. a scan of a book such as /Historio de Mondolingvo/ by
E. Drezen, it may be advantageous to get a list of most numerous
errors; in Unix this can be done with a one-liner:
#+begin_src sh
$ ispell -H -l -d eo -T utf8 < Drezen.html | sort -if | uniq -c | sort -nr | head -12
#+end_src
#+begin_example
    215 ciuj
    209 tin
    185 gi
    168 lau
    167 ankau
    156 ce
    143 au
    127 ec
    120 in
    120 autoro
    112 Paris
    109 Volapiik
#+end_example
(the 1st column indicates the number of occurrences of the error).
With such a list one can correct hundreds or dozens of errors with a
single command.

# Lagetʼ malnova ... neniʼ en aŭdʼ ... Jen rano -- plaŭdʼ! ... Silentʼ...
#
# Lagetʼ malnova M-bM-^@M-& neniʼ en aŭdʼ M-bM-^@M-& Jen rano M-bM-^@M-^T plaŭdʼ! M-bM-^@
#
#
# Again, the Ispell editor is available for this case too, and the
# esperantic characters are shown as expected; but the non-Latin3
# characters aren't made known to the editor, thus they are shown as
# mojibake.

*** Latin-3
You may safely skip this section, unless you are interestwed in
history of computing or have to use software which accepts only single-byte
encodings.

The ISO 8859‑3 encoding, aka Latin‑3, is now rarely used; yet it is for
such a single-byte encoding that Ispell was developed. Presently a
Latin‑3 terminal is not readily available; one could install ~xterm~ and
its ~luit~ package; and then either launch =xterm= in Latin‑3:
#+begin_src sh
$ xterm -en 'ISO 8859-3' &
#+end_src

or use =luit= as a filter:

#+begin_src sh
$ luit -encoding 'ISO 8859-3' echo eĥoŝanĝo | od -c
#+end_src

# #+RESULTS:
: 0000000   e 266   o 376   a   n 370   o  \n
: 0000011

(the ~echo|od~ commands attest that the non-ASCII letters are encoded
in Latin‑3).

In this environment the dialog Ispell Editor shall work as expected:
#+begin_src sh
ispell -d eo -T latin3 $HOME/Git/ispell-eo/doc/testo.l3
#+end_src
(the file =testo.l3= is written in the Latin‑3 encoding).

# In order to get a list of all misspelled or unknown words from a text in
# the Latin‑3 encoding you could say (in Linux):
#
# #+begin_src sh
# export LC_ALL=eo_XX.ISO-8859-3
# ispell -d esperanto -T .l3 -l < FILENAME | sort -u
# #+end_src


<<e-ini>>
** Emacs
Normally I use Ispell in an Emacs session. Emacs is distributed with
the =ispell.el= package, which provides an interface with the ispell
processes (see “[[https://www.emacswiki.org/emacs/InteractiveSpell][InteractiveSpell]]” in Emacs' Wiki). This package
includes, among others, specifications for interactions with the
permissive =esperanto= dictionary in two representations: =latin3= and
=tex=; in ispell.el they are named resp. =esperanto= and
=esperanto-tex=.
# Also: [[https://github.com/emacs-mirror/emacs/blob/master/lisp/textmodes/ispell.el][ispell.el]] in Github

Don't be affraid of the name =latin3=: your text may be (and normally
is) in Unicode; the program seamlessly converts your UTF-8 words to
Latin‑3 and back, using Latin‑3 behind the scenes, so that you never notice
it. The only exception is the limitation of the repertoire of the
characters available for word representation: e.g. you cannot use the curly
apostrophe, which is absent from Latin‑3, and thus cannot be passed to
ispell.

As mentioned earlier, the Esperantic Ispell dictionaries can accept the
UTF-8 input; alas, for some bugs in =ispell.el= conversions from the
integer Unicode codepoints to multibyte UTF-8 and back “may result in the
evil misalignment error”; the interaction with 1-byte codes (e.g.
Latin‑3) is more stable.

In my practical work I prefer the stricter =eo.hash= dictionary (and
the x‑style ASCIIization); both are made available via the
=./emacs/ispell-ini.el= customization included in this distribution.
You may copy it into your =site-lisp= (or somewhere else on your emacs'
=load-path=), and put this into your =.emacs=:

#+begin_src elisp
  (load "ispell-ini.el")
#+end_src

=ispell-ini.el= provides access to the hash dictionaries via the
names of the Esperanto representations it defines:

  eo   : latin3(eo.hash)
  epo  : epo(eo.hash)
  eo-x : cxirkaux(eo.hash)
  esperanto-x : cxirkaux(esperanto.hash)

The representation names =latin3, , cxirkax= are described above in
“[[styles][Esperanto encodings]]”. =epo= is basically =latin3= extended with a
special care of the curly apostrophes; it enables use (and check) of
Unicode coded texts, even though the stable ispell representation is
functioning in the single-byte Latin‑3 encoding. This solution is
presented in the next section.

<<Apo>>
