README.md


<a id="org1aaed29"></a>

### ASCII terminal

This is available anywhere, you can use the `tex` (TeX) or the
`cxirkaux` representation. In the `tex` representation the word
*ĉirkaŭ* takes the form `^cirka^u`; in the latter case both esperantic
accents are expressed with the letter `x`, do `cxirkaux`. In order to
check a file with the Ispell dialog editor simply type (for the
x‑notation):

    ispell -d eo -T cxirkaux $HOME/Git/ispell-eo/doc/ekz.cx

or (fro the TeX notation):

    $ ispell -d eo -T tex $HOME/Git/ispell-eo/doc/ekz.^c

The resulting dialog is self-explanatory.

You also can request a list of misspelt words, e.g.

    $ cat -b $HOME/Git/ispell-eo/doc/ekz.cx
    $ ispell -d eo -T cxirkaux -l < $HOME/Git/ispell-eo/doc/ekz.cx

         1	Por ke la linguo intrenacia povu bone kaj regule progresadi kaj por ke
         2	gxi havu plenan cetrecon, ke gxi neniam disfalos kaj ia facxilanima
         3	pasxo de gxiaj amikoj estontaj ne detruos la laborojn de gxiaj amikoj
         4	estitaj, -- estas plej necesa antaux cxio unu kondico: la ekzistado de
         5	klare difinita, neniam tusxebla kaj neniam sxangxebla Fundamento ...
    
         6	en nova form' eksonis nova kant'
    linguo
    intrenacia
    cetrecon
    facxilanima
    estitaj
    kondico

Unfortunately, the Ispell editor is unaware of multibyte characters.


<a id="org625f9b2"></a>

### Unicode

Ispell is two decades older than Unicode; yet it is possible to use
its general specification facilities to define the UTF-8 encoding of
the Esperantic letters, and it partially works.

The modern Linux terminals use the UTF-8 encoding by default, so you
can say there:

    $ ispell -d eo -T utf8 $HOME/Git/ispell-eo/doc/testo.u8

or submit test words in the command  line:

    $ echo "faĉilanima paŝo de ĝiaj anikoj estitaj" | ispell -T utf8 -d eo

    @(#) International Ispell Version 3.4.02 08 Jan 2021
    word: how about: facilanima
    ok (derives from root PA^SI)
    ok
    ok (derives from root ^GI)
    how about: amikoj, anigoj, aniĝoj, animoj, aninoj, anizoj, manikoj, panikoj, unikoj
    how about: estigaj, estiĝaj, estimaj, estintaj, estritaj, festitaj, ostitaj, testitaj, vestitaj, esti+taj, estu-u+itaj
    
    word:

(The suggestions are presented in the TeX notation.)

You can also get a list of all misspelled or unknown words from a text:

    $ head -9 $HOME/Git/ispell-eo/doc/Cart.u8

    AL Sinjoro fruictier.
    Kara Amiko!
    Vi petis, ke mi prezentu vian libron al Esperantistaro.
    Prezentadon ĝi ne bezonas: ne sole ĉar la ĉefredaktoro
    de »Lingvo Internacia« jam elmontris sian valoron, sed
    precipe ĉar lia verko estas kunmetita laŭ principoj
    de severega metodo. Eĵektive, kio eslas farita per Scienco
    kaj en ĝia nomo, tio tute ne bezonas patronadon, ĉar
    ne ekzistas pli atta.

    $ head -9 $HOME/Git/ispell-eo/doc/Cart.u8 | ispell -d eo -T utf8 -l

    fruictier
    Eĵektive
    eslas
    atta

(The file `Cart.u8` is produced by OCR of a letter by Th. Cart to Paul
Fruictier, published as a foreword to “Esperanta Sintakso” by the
latter. The letter is printed in italics.)

Such a short file is more conveniently corrected in a text editor
via its speller interface (see “[Emacs](#org0b61009)” below); but when editing a
large file, e.g. a scan of a book such as *Historio de Mondolingvo* by
E. Drezen, it may be advantageous to get a list of most numerous
errors; in Unix this can be done with a one-liner:

    $ ispell -H -l -d eo -T utf8 < Drezen.html | sort -if | uniq -c | sort -nr | head -12

        215 ciuj
        209 tin
        185 gi
        168 lau
        167 ankau
        156 ce
        143 au
        127 ec
        120 in
        120 autoro
        112 Paris
        109 Volapiik

(the 1st column indicates the number of occurrences of the error).
With such a list one can correct hundreds or dozens of errors with a
single command.


<a id="orgcb665ea"></a>

### Latin-3

You may safely skip this section, unless you are interestwed in
history of computing or have to use software which accepts only single-byte
encodings.

The ISO 8859‑3 encoding, aka Latin‑3, is now rarely used; yet it is for
such a single-byte encoding that Ispell was developed. Presently a
Latin‑3 terminal is not readily available; one could install `xterm` and
its `luit` package; and then either launch `xterm` in Latin‑3:

    $ xterm -en 'ISO 8859-3' &

or use `luit` as a filter:

    $ luit -encoding 'ISO 8859-3' echo eĥoŝanĝo | od -c

    0000000   e 266   o 376   a   n 370   o  \n
    0000011

(the `echo|od` commands attest that the non-ASCII letters are encoded
in Latin‑3).

In this environment the dialog Ispell Editor shall work as expected:

    ispell -d eo -T latin3 $HOME/Git/ispell-eo/doc/testo.l3

(the file `testo.l3` is written in the Latin‑3 encoding).

<a id="org0b61009"></a>


<a id="org3c07fff"></a>

## Emacs

Normally I use Ispell in an Emacs session. Emacs is distributed with
the `ispell.el` package, which provides an interface with the ispell
processes (see “[InteractiveSpell](https://www.emacswiki.org/emacs/InteractiveSpell)” in Emacs' Wiki). This package
includes, among others, specifications for interactions with the
permissive `esperanto` dictionary in two representations: `latin3` and
`tex`; in ispell.el they are named resp. `esperanto` and
`esperanto-tex`.

Don't be affraid of the name `latin3`: your text may be (and normally
is) in Unicode; the program seamlessly converts your UTF-8 words to
Latin‑3 and back, using Latin‑3 behind the scenes, so that you never notice
it. The only exception is the limitation of the repertoire of the
characters available for word representation: e.g. you cannot use the curly
apostrophe, which is absent from Latin‑3, and thus cannot be passed to
ispell.

As mentioned earlier, the Esperantic Ispell dictionaries can accept the
UTF-8 input; alas, for some bugs in `ispell.el` conversions from the
integer Unicode numbers to multibyte UTF-8 and back “may result in the
evil misalignment error”; the interaction with 1-byte codes (e.g.
Latin‑3) is more stable.

In my practical work I prefer the stricter `eo.hash` dictionary (and
the x‑style ASCIIization); both are made available via the
`./emacs/ispell-ini.el` customization included in this distribution.
You may copy it into your `site-lisp` (or somewhere else on your emacs'
`load-path`), and put this into your `.emacs`:

    (load "ispell-ini.el")

`ispell-ini.el` provides access to the hash dictionaries via the
names of the Esperanto representations it defines:

eo   : latin3(eo.hash)
epo  : epo(eo.hash)
eo-x : cxirkaux(eo.hash)
esperanto-x : cxirkaux(esperanto.hash)

The representation names `latin3, , cxirkax` are described above in
“[Esperanto encodings](#org56e6dfc)”. `epo` is basically `latin3` extended with a
special care of the curly apostrophes; it enables use (and check) of
Unicode coded texts, even though the stable ispell representation is
functioning in the single-byte Latin‑3 encoding. This solution is
presented in the next section.
