README.md

<a id="org6d8564e"></a>


<a id="org6567e7f"></a>

# Apostrophes

In English, the apostrophes appear either inside a word, like in
*isn't* (and this case is addressed by the `boundarychars`
specification), or after a well-formed word, like in *for goodness'
sake* (where the exclusion of the apostrophe does not raise a false
error report). Confusions with quotes are infrequent, yet possible:

    $ echo 'Tis the season to be jolly! | ispell | head -2

    @(#) International Ispell Version 3.4.02 08 Jan 2021
    word: how about: Dis, His, Is, Its, Otis, Pis, Sis, T's, TAs, This, Ti, Ti's, Tia, Tic, Tics, Tie, Ties, Tim, Tims, Tin, Tins, Tip, Tips, Tit, Tits, Ti s, Ti-s, Ts, TVs, T is, T-is, Vis

In Esperanto apostrophes appear mainly as the last of the wordʼs
characters, i.e. in a most error-prone position:

    en nova form' eksonis nova kant'

Ispell and Aspell are able to treat such postfix apostrophes; Hunspell
and Vim Speller take account of non-letter characters (e.g. `-` or
`'`) only inside a word, when they occur between two letters.

Actually the fine typography requires a curly apostrophe, and Unicode
offers two options:

-   the *modifier letter apostrophe* ‹ʼ› U+02BC, and
-   the *right single quotation mark* ‹’› U+2019.

The letter apostrophe is classified by Unicode as a letter, and as
such perfectly suits the Esperantic spelling dictionaries for Hunspell
and Vim Speller; hence the Hunspell spelling dictionary for Esperanto,
distributed with LibreOffice, as well as my conversion for Vim Speller
both cannot but opt for U+02BC.

Unfortunately the impact of the English (or rather Microsoft's)
tradition imposes the use of U+2019 (e.g. great many fonts which
follow the Microsoftʼs WGL4 standard have U+2019 and lack U+02BC).
Also the Unicode® Standard 15.1.0 (2023 Sept. 12), [Chapter 6](https://www.unicode.org/versions/Unicode15.0.0/ch06.pdf), supports
this confusion:

> An implementation cannot assume that users’ text always adheres to the
> distinction between these characters. The text may come from different
> sources, including mapping from other character sets that do not make
> this distinction between the letter apostrophe and the punctuation
> apostrophe/right single quotation mark. In that case, *all* of them
> will generally be represented by U+2019.
> 
> The semantics of U+2019 are therefore context dependent. For example,
> if surrounded by letters or digits on both sides, it behaves as an
> in-text punctuation character and does not separate words or lines.

This [Wrong Thing](http://catb.org/jargon/html/W/Wrong-Thing.html) works for English and French; it fails for Esperanto
and other languages where apostrophes may behave as a word element at
the word boundary; i.e. the ISO standard is not international enough.

In an Ispell specification any character may be declared a letter;
thus the `eo, esperanto, eo-x, esperanto-x` representations use the
ASCII apostrophe ‹'›; the `utf8` (unavailable via the `ispell.el`
interface) uses U+2019 (this can be changed to U+02BC by replacing one
line in the affix file). Unfortunately the interaction between the
`utf8` representation in Ispell and `ispell.el` remains unstable for
“the evil misalignment error”.

As a workaround, alongside the traditional `latin3` representation,
which uses the ASCII apostrophe, there is the `epo` representation in
Ispell, in which the ASCII apostrophe is ignored (and available for
any non-lexical usage); the Esperantic *letter apostrophe* is
represented by the otherwise unused Latin‑3 character ‹´› (*spacing
acute,* 0xB4). Now, the attached `ispell-ini.el` file *advises* the
interface functions `ispell-send-string` and `ispell-parse-output` in
such a way, that in the input string sent to the Ispell process the
curly apostrophes (either U+2019 or U+02BC) are replaced with 0xB4;
and in the Ispellʼs output this character (if any) is recoded back to
the “canonical” apostrophe representation, specified by the
`ispell-apostrophe` Elisp variable. Its default value is U+2019 (right
quote), but it can be toggled to U+02BC and back by the interactive
Elisp function

    M-x ispell-set-apostrophe

When given a numeric prefix, this function can also set the variable
unconditionally: with 1 it is set to the letter apostrophe ‹ʼ›; with
2, to the right quotation mark ‹’›.


<a id="orgf442fb8"></a>

## Apostrophes in Wikipedia

In informal writing one usually would prefer the easier ASCII
apostrophes, and apply the `eo` spellcheck; `epo` is appropriate when
one in preparing a typographic quality text, or when the ASCII
apostrophe is used for some extra-lingual purpose, like in Wikipedia
sources.

Take for example the source text of article «[Majusklo](https://eo.wikipedia.org/wiki/Majusklo)» in the
Esperanto Wikipedia (triple apostrophes are the boldface mark):

    '''Majusklo''' (aŭ '''grandlitero''' aŭ '''ĉeflitero''')
    estas unu el du formoj, kiujn povas havi ĉiu litero ...

The `eo` spellcheck would complain about the inexistent words
<code>'''Majusklo'''</code>, <code>'''grandlitero'''</code>, <code>'''ĉeflitero'''</code>
Please note that such a nuisance does not occur in English or French,
where the apostrophes are recognized only within a word, between two letters.
On the one hand this is a language-dependent feature, which is not
equally convenient internationally (but was Wikipedia conceived as an
international project?). On the other hand, it may be useful to
promote the typographically preferable form of the apostrophes.


<a id="orged9f4b8"></a>

## Switching the Ispell Dictionaries

`ispell.el` provides the `spell-change-dictionary` function, bound to
`C-c i c`, ekz‑e

`C-c i c RET epo RET` selects the `epo` “dictionary” with ‹’›;  
`C-c i c RET eo RET` selects the `eo` “dictionary” with ‹'›.

It can also be invoked from the menu:

    Tools → Spell Checking → Change Dictionary ...

`ispell-ini.el` adds a few commands for easier switching:

`C-c i 3` sets the Esperanto `eo` (`latin3`) dictionary  
`C-u C-c i 3` sets the Esperanto `epo` dictionary  
`C-c i x` sets the Esperanto `eo-x` dictionary  
`C-u C-c i x` sets the `esperanto-x` dictionary

`C-c i a` sets the American English dictionary  
`C-c i f` sets the French dictionary  
`C-c i p` sets the Russian dictionary.


<a id="orgc8a23b8"></a>

## Inputting Apostrophes and Quotation Marks

In order to input curly apostrophes `ispell.el` provides the command

    C-c i '

It inserts U+2019 or U+02BC, according to the current value of
`ispell-apostrophe`.

The quotation marks can be inputted pairwise, and the cursor is
positioned in between; if there is an active region, the quotation
marks are put around it. The commands (shortcuts) are:

`C-c "` makes a pair of guillemets «│»  
`C-c 9` makes a 99—66 pair: „│“  
`C-c <` makes a pair of single guillemets: ‹│›  
`C-c 6` makes a 66—99 pair: “│”.
