doc/readme.org
** Inputting the Letter-Apostrophe in Linux
Out of the box there is no convenient means to enter the letter
apostrophe U+02BC. Composing the Unicode codepoint is clumsy. The
[[https://en.wikipedia.org/wiki/Compose_key][compose key]] facility is not aware about it.

In many Linux distributions the supersigned Esperantic letters can be
inputted as combination of AltGr and the base Latin letter; this can
be extended to the letter-apostrophe, ideally by modifying the
standard =/usr/share/X11/xkb/symbols/epo= file; while this is not done
one can define an appropriate key combination via =xmodmap=.

ASCII apostrophe is often used to enter the acute diacritics (e.g.
~AltGr+e~ → ~é~); so, I’ve chosen the comma (it may is used for
inputting cedilla; but I seldom need it, less often than acute; and
the diacritics in question are available via Compose). So,
#+begin_src sh
$ xmodmap -e 'keycode 59 = comma less comma less U02BC U2019'
#+end_src
This works for most of Latin-based layouts (mi tested the British =gb=
and German =de=); paradoxically there is some bug in the most widely
used US layout: the above =xmodmap= does not effect it. It works
with US International (=us,intl=), but it is inconvenient for
programming (~`echo FOO`~ becomes ~ècho FOO`~ etc).

Thus I’ve chosen the South African layout ~za,basic~, which is
identical to ~us~ at the levels 1 and 2, which accepts the =xmodmap=
command, and whose level 3 offers extra bonuses; e.g.
~AltGr+z~ = =«=, ~AltGr+x~ = =»=. The /Ubuntu/ philosophy! ☺

** Further Reading on the Apostrophe Problem
- [[../doc/apostrofoj.html][Pri apostrofoj kaj citiloj en Esperanto]] (in Esperanto)
- [[https://tedclancy.wordpress.com/2015/06/03/which-unicode-character-should-represent-the-english-apostrophe-and-why-the-unicode-committee-is-very-wrong][Which Unicode character should represent the English apostrophe?
  (And why the Unicode committee is very wrong)]]
- [[https://groups.google.com/g/gnu.emacs.help/c/FPjX1kCHIB4][Getting Emacs to play nice with Hunspell and apostrophes]] (a thread
  in the ~<help-gnu-emacs@gnu.org>~ forum)
- [[https://askubuntu.com/questions/788484/insert-a-unicode-character-via-keyboard-shortcut-xmodmap-chooser-not-working][xmodmap chooser not working]].

#  LocalWords:  multibyte Fruictier Esperanta eo xB Komputika BC WGL
#  LocalWords:  Leksikono Elisp

