README.md


<a id="org572fa9f"></a>

## Further Reading on the Apostrophe problem

-   [Pri apostrofoj kaj citiloj en Esperanto](doc/apostrofoj.md) (in Esperanto)
-   [Which Unicode character should represent the English apostrophe? (And why the Unicode committee is very wrong)](https://tedclancy.wordpress.com/2015/06/03/which-unicode-character-should-represent-the-english-apostrophe-and-why-the-unicode-committee-is-very-wrong)
-   [Getting Emacs to play nice with Hunspell and apostrophes](https://groups.google.com/g/gnu.emacs.help/c/FPjX1kCHIB4) (a thread
    in the `<help-gnu-emacs@gnu.org>` forum)

